Docs/Reference/Content/images/dependencies/net10.0/d2/alloverit-aws-appsync-client.d2
direction: left

aoi: AllOverIt
aoi.alloverit-aws-appsync-client: AllOverIt.Aws.AppSync.Client
microsoft-extensions-dependencyinjection_10-0-9: Microsoft.Extensions.DependencyInjection\nv10.0.9
microsoft-extensions-dependencyinjection-abstractions_10-0-9: Microsoft.Extensions.DependencyInjection.Abstractions\nv10.0.9
microsoft-extensions-http_10-0-9: Microsoft.Extensions.Http\nv10.0.9
microsoft-extensions-configuration-abstractions_10-0-9: Microsoft.Extensions.Configuration.Abstractions\nv10.0.9
microsoft-extensions-diagnostics_10-0-9: Microsoft.Extensions.Diagnostics\nv10.0.9
microsoft-extensions-logging_10-0-9: Microsoft.Extensions.Logging\nv10.0.9
microsoft-extensions-logging-abstractions_10-0-9: Microsoft.Extensions.Logging.Abstractions\nv10.0.9
microsoft-extensions-options_10-0-9: Microsoft.Extensions.Options\nv10.0.9
aoi.alloverit-reactive: AllOverIt.Reactive
system-reactive_6-1-0: System.Reactive\nv6.1.0
aoi.alloverit: AllOverIt
aoi.alloverit-assertion: AllOverIt.Assertion
aoi.alloverit-serialization-json-abstractions: AllOverIt.Serialization.Json.Abstractions
microsoft-extensions-dependencyinjection_10-0-9 <- aoi.alloverit-aws-appsync-client
microsoft-extensions-dependencyinjection-abstractions_10-0-9 <- microsoft-extensions-dependencyinjection_10-0-9
microsoft-extensions-http_10-0-9 <- aoi.alloverit-aws-appsync-client
microsoft-extensions-configuration-abstractions_10-0-9 <- microsoft-extensions-http_10-0-9
microsoft-extensions-dependencyinjection-abstractions_10-0-9 <- microsoft-extensions-http_10-0-9
microsoft-extensions-diagnostics_10-0-9 <- microsoft-extensions-http_10-0-9
microsoft-extensions-logging_10-0-9 <- microsoft-extensions-http_10-0-9
microsoft-extensions-logging-abstractions_10-0-9 <- microsoft-extensions-http_10-0-9
microsoft-extensions-options_10-0-9 <- microsoft-extensions-http_10-0-9
aoi.alloverit-reactive <- aoi.alloverit-aws-appsync-client
system-reactive_6-1-0 <- aoi.alloverit-reactive
aoi.alloverit <- aoi.alloverit-reactive
aoi.alloverit-assertion <- aoi.alloverit
aoi.alloverit-serialization-json-abstractions <- aoi.alloverit-aws-appsync-client
aoi.alloverit <- aoi.alloverit-serialization-json-abstractions
microsoft-extensions-dependencyinjection_10-0-9.style.fill: "#ADD8E6"
microsoft-extensions-dependencyinjection_10-0-9.style.opacity: 0.8
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.opacity: 0.8
microsoft-extensions-http_10-0-9.style.fill: "#ADD8E6"
microsoft-extensions-http_10-0-9.style.opacity: 0.8
microsoft-extensions-configuration-abstractions_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-configuration-abstractions_10-0-9.style.opacity: 0.8
microsoft-extensions-diagnostics_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-diagnostics_10-0-9.style.opacity: 0.8
microsoft-extensions-logging_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-logging_10-0-9.style.opacity: 0.8
microsoft-extensions-logging-abstractions_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-logging-abstractions_10-0-9.style.opacity: 0.8
microsoft-extensions-options_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-options_10-0-9.style.opacity: 0.8
system-reactive_6-1-0.style.fill: "#ADD8E6"
system-reactive_6-1-0.style.opacity: 0.8
aoi.style.fill: "#E7EBFC"
aoi.style.opacity: 1
