Docs/Reference/Content/images/dependencies/net10.0/mmd/alloverit-aws-appsync-client.mmd
flowchart LR
  alloverit-aws-appsync-client["AllOverIt.Aws.AppSync.Client"]
  microsoft-extensions-dependencyinjection_10-0-9["Microsoft.Extensions.DependencyInjection<br>v10.0.9"]
  microsoft-extensions-dependencyinjection-abstractions_10-0-9["Microsoft.Extensions.DependencyInjection.Abstractions<br>v10.0.9"]
  microsoft-extensions-http_10-0-9["Microsoft.Extensions.Http<br>v10.0.9"]
  microsoft-extensions-configuration-abstractions_10-0-9["Microsoft.Extensions.Configuration.Abstractions<br>v10.0.9"]
  microsoft-extensions-diagnostics_10-0-9["Microsoft.Extensions.Diagnostics<br>v10.0.9"]
  microsoft-extensions-logging_10-0-9["Microsoft.Extensions.Logging<br>v10.0.9"]
  microsoft-extensions-logging-abstractions_10-0-9["Microsoft.Extensions.Logging.Abstractions<br>v10.0.9"]
  microsoft-extensions-options_10-0-9["Microsoft.Extensions.Options<br>v10.0.9"]
  alloverit-reactive["AllOverIt.Reactive"]
  system-reactive_6-1-0["System.Reactive<br>v6.1.0"]
  alloverit["AllOverIt"]
  alloverit-assertion["AllOverIt.Assertion"]
  alloverit-serialization-json-abstractions["AllOverIt.Serialization.Json.Abstractions"]
  alloverit-aws-appsync-client --> microsoft-extensions-dependencyinjection_10-0-9
  microsoft-extensions-dependencyinjection_10-0-9 --> microsoft-extensions-dependencyinjection-abstractions_10-0-9
  alloverit-aws-appsync-client --> microsoft-extensions-http_10-0-9
  microsoft-extensions-http_10-0-9 --> microsoft-extensions-configuration-abstractions_10-0-9
  microsoft-extensions-http_10-0-9 --> microsoft-extensions-dependencyinjection-abstractions_10-0-9
  microsoft-extensions-http_10-0-9 --> microsoft-extensions-diagnostics_10-0-9
  microsoft-extensions-http_10-0-9 --> microsoft-extensions-logging_10-0-9
  microsoft-extensions-http_10-0-9 --> microsoft-extensions-logging-abstractions_10-0-9
  microsoft-extensions-http_10-0-9 --> microsoft-extensions-options_10-0-9
  alloverit-aws-appsync-client --> alloverit-reactive
  alloverit-reactive --> system-reactive_6-1-0
  alloverit-reactive --> alloverit
  alloverit --> alloverit-assertion
  alloverit-aws-appsync-client --> alloverit-serialization-json-abstractions
  alloverit-serialization-json-abstractions --> alloverit
  style microsoft-extensions-dependencyinjection_10-0-9 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-dependencyinjection-abstractions_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-http_10-0-9 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-configuration-abstractions_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-diagnostics_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-logging_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-logging-abstractions_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-options_10-0-9 fill:#FFEC96,opacity:0.8
  style system-reactive_6-1-0 fill:#ADD8E6,opacity:0.8
